-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Oct 24, 2023 at 07:17 AM
-- Server version: 10.5.20-MariaDB
-- PHP Version: 7.3.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `id21338467_thesis`
--

-- --------------------------------------------------------

--
-- Table structure for table `data_newer1`
--

CREATE TABLE `data_newer1` (
  `ID` int(11) NOT NULL,
  `gender` varchar(5) DEFAULT NULL,
  `education` int(1) DEFAULT NULL,
  `status_` varchar(10) DEFAULT NULL,
  `dis_type` int(1) DEFAULT NULL,
  `tool` int(1) DEFAULT NULL,
  `keeper` varchar(17) DEFAULT NULL,
  `invest` int(7) DEFAULT NULL,
  `loan` int(6) DEFAULT NULL,
  `hobby` varchar(200) DEFAULT NULL,
  `aptitude` varchar(200) DEFAULT NULL,
  `commute` varchar(200) DEFAULT NULL,
  `occupation` varchar(42) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `data_newer1`
--

INSERT INTO `data_newer1` (`ID`, `gender`, `education`, `status_`, `dis_type`, `tool`, `keeper`, `invest`, `loan`, `hobby`, `aptitude`, `commute`, `occupation`) VALUES
(1, 'ชาย', 5, 'สมรส', 3, 5, 'ไม่มี', 0, 4000, 'ทำงานประดิษฐ์/งานช่าง', 'ด้านการช่าง/ซ่อมแซม', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างซ่อมเครื่องยนต์'),
(2, 'ชาย', 6, 'โสด', 3, 1, 'ไม่มี', 0, 0, 'ทำอาหาร, ปลูกต้นไม้', 'ด้านมนุษย์สัมพันธ์, ด้านการเกษตร', 'รถโดยสารประจำทาง, เดินเท้า', 'เกษตรกร'),
(3, 'หญิง', 6, 'โสด', 2, 2, 'ไม่มี', 0, 30000, 'เสริมสวย/แต่งหน้า/ทำผม, ทำอาหาร, ปลูกต้นไม้', 'ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว, เดินเท้า', 'เกษตรกร'),
(4, 'หญิง', 2, 'สมรส', 8, 1, 'ไม่มี', 30000, 40000, 'ทำอาหาร', 'ด้านการเกษตร', 'ทำงานที่บ้าน (WFH)', 'เกษตรกร'),
(5, 'หญิง', 2, 'สมรส', 3, 4, 'ไม่มี', 0, 0, 'ปลูกต้นไม้', 'ด้านการเกษตร', 'ทำงานที่บ้าน (WFH)', 'เกษตรกร'),
(6, 'ชาย', 2, 'สมรส', 3, 1, 'สามี/ภรรยา', 50000, 0, 'ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว, เดินเท้า', 'เกษตรกร'),
(7, 'ชาย', 2, 'สมรส', 2, 1, 'สามี/ภรรยา', 0, 0, 'เลี้ยงสัตว์', 'ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'เกษตรกร'),
(8, 'อื่นๆ', 6, 'โสด', 2, 2, 'ไม่มี', 0, 0, 'เสริมสวย/แต่งหน้า/ทำผม', 'ด้านคอมพิวเตอร์', 'ทำงานที่บ้าน (WFH)', 'เจ้าหน้าที่ธุรการ'),
(9, 'หญิง', 5, 'สมรส', 3, 1, 'ไม่มี', 0, 0, 'ทำงานฝีมือ/งานศิลปะ, เสริมสวย/แต่งหน้า/ทำผม, ทำอาหาร', 'ด้านศิลปะ/งานฝีมือ', 'ทำงานที่บ้าน (WFH)', 'เย็บผ้า ปักผ้า'),
(10, 'หญิง', 3, 'โสด', 3, 1, 'ไม่มี', 50000, 20000, 'ทำอาหาร', 'ด้านภาษา, ด้านมนุษย์สัมพันธ์', 'รถยนต์ส่วนตัว, รถจักรยานยนต์ส่วนตัว', 'แม่ค้า'),
(11, 'หญิง', 3, 'สมรส', 3, 5, 'สามี/ภรรยา', 30000, 0, 'ไม่มี', 'ไม่มี', 'ทำงานที่บ้าน (WFH)', 'แม่ค้าเบเกอรี่ออนไลน์'),
(12, 'หญิง', 6, 'สมรส', 2, 1, 'ไม่มี', 0, 0, 'ไม่มี', 'ด้านกีฬา, ด้านมนุษย์สัมพันธ์, ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'แม่บ้าน'),
(13, 'อื่นๆ', 6, 'โสด', 3, 1, 'ไม่มี', 0, 0, 'ทำงานประดิษฐ์/งานช่าง, เล่นกีฬา/ออกกำลังกาย, ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านภาษา, ด้านการช่าง/ซ่อมแซม, ด้านมนุษย์สัมพันธ์, ด้านการเกษตร', 'ทำงานที่บ้าน (WFH)', 'โปรแกรมเมอร์​'),
(14, 'อื่นๆ', 6, 'สมรส', 3, 6, 'ไม่มี', 20000, 0, 'ทำงานประดิษฐ์/งานช่าง, แต่งรถ', 'ด้านการช่าง/ซ่อมแซม', 'รถจักรยานยนต์ส่วนตัว', 'ไรเดอร์ส่งอาหาร'),
(15, 'ชาย', 3, 'สมรส', 3, 1, 'สามี/ภรรยา', 0, 0, 'ทำงานประดิษฐ์/งานช่าง, ปลูกต้นไม้', 'ไม่มี', 'รถจักรยานยนต์ส่วนตัว', 'ขับแท็กซี่'),
(16, 'ชาย', 7, 'สมรส', 3, 5, 'สามี/ภรรยา', 100000, 10000, 'เล่นกีฬา/ออกกำลังกาย', 'ไม่มี', 'รถยนต์ส่วนตัว', 'ขับรถรับจ้าง'),
(17, 'ชาย', 6, 'สมรส', 1, 1, 'ไม่มี', 0, 0, 'เล่นดนตรี/ร้องเพลง', 'ด้านดนตรี', 'ทำงานที่บ้าน (WFH)', 'ขายล็อตเตอรี่ เล่นดนตรี และทำงานบริษัท'),
(18, 'ชาย', 3, 'โสด', 8, 7, 'คนอื่นๆในครอบครัว', 100000, 20000, 'ทำงานประดิษฐ์/งานช่าง', 'ด้านการช่าง/ซ่อมแซม, ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'ขายลอตเตอรี่​'),
(19, 'ชาย', 3, 'โสด', 8, 7, 'คนอื่นๆในครอบครัว', 100000, 20000, 'ทำงานประดิษฐ์/งานช่าง, ปลูกต้นไม้', 'ด้านการช่าง/ซ่อมแซม, ด้านการเกษตร', 'รถจักรยานยนต์ส่วนตัว', 'ขายลอตเตอรี่, ​ซ่อม​เครื่อง​ยนต์​การเกษตร​'),
(20, 'หญิง', 3, 'โสด', 8, 7, 'จ้างคนมาดูแล', 0, 10000, 'ปลูกต้นไม้', 'ด้านศิลปะ/งานฝีมือ', 'ทำงานที่บ้าน (WFH)', 'ขายสินค้าออนไลน์'),
(21, 'หญิง', 2, 'หม้าย', 3, 4, 'ลูก/หลาน', 0, 0, 'ไม่มี', 'ด้านค้าขาย', 'ทำงานที่บ้าน (WFH)', 'ขายสินค้าออนไลน์'),
(22, 'ชาย', 2, 'สมรส', 8, 7, 'ไม่มี', 0, 0, 'ขับเคลื่อนงานด้านองค์กรคนพิการ', 'ด้านการช่าง/ซ่อมแซม', 'รถยนต์ส่วนตัว', 'ค้าขาย'),
(23, 'ชาย', 3, 'สมรส', 3, 1, 'ไม่มี', 300000, 0, 'ไม่มี', 'ไม่มี', 'รถยนต์ส่วนตัว', 'ค้าขาย'),
(24, 'หญิง', 3, 'โสด', 3, 1, 'ไม่มี', 0, 0, 'ทำงานฝีมือ/งานศิลปะ, ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านภาษา, ด้านศิลปะ/งานฝีมือ, ด้านการเกษตร', 'ทำงานที่บ้าน (WFH)', 'งานIT, งานออฟฟิศ'),
(25, 'หญิง', 7, 'สมรส', 3, 1, 'ไม่มี', 0, 0, 'เล่นกีฬา/ออกกำลังกาย', 'ด้านภาษา, ด้านศิลปะ/งานฝีมือ', 'ทำงานที่บ้าน (WFH)', 'งานIT, งานออฟฟิศ'),
(26, 'ชาย', 3, 'โสด', 3, 1, 'พี่/น้อง', 0, 0, 'ทำงานประดิษฐ์/งานช่าง, เลี้ยงสัตว์', 'ด้านการช่าง/ซ่อมแซม', 'รถจักรยานยนต์ส่วนตัว', 'ช่างไฟฟ้าและเขียนแบบAutocad'),
(27, 'ชาย', 2, 'หม้าย', 3, 1, 'ลูก/หลาน', 2000, 10000, 'ทำงานประดิษฐ์/งานช่าง, เสริมสวย/แต่งหน้า/ทำผม', 'ด้านการช่าง/ซ่อมแซม, ด้านมนุษย์สัมพันธ์', 'รถจักรยานยนต์ส่วนตัว', 'ช่างซ่อมรถ, ช่างตัดผม'),
(28, 'หญิง', 6, 'หม้าย', 2, 2, 'บิดา/มารดา', 0, 0, 'ไม่มี', 'ไม่มี', 'รถยนต์ส่วนตัว', 'ทำเอกสาร'),
(29, 'ชาย', 3, 'โสด', 3, 7, 'ไม่มี', 0, 0, 'เลี้ยงสัตว์', 'ด้านภาษา', 'ทำงานที่บ้าน (WFH)', 'ทำงานตรวจสอบและวิเคราะห์'),
(30, 'ชาย', 6, 'โสด', 3, 1, 'บิดา/มารดา', 0, 0, 'เล่นกีฬา/ออกกำลังกาย, ทำอาหาร', 'ด้านกีฬา', 'รถจักรยานยนต์ส่วนตัว', 'ธุรกิจส่วนตัว'),
(31, 'ชาย', 6, 'โสด', 9, 1, 'ไม่มี', 0, 0, 'เล่นดนตรี/ร้องเพลง', 'ด้านดนตรี', 'รถโดยสารประจำทาง', 'นักดนตรี'),
(32, 'ชาย', 3, 'โสด', 3, 5, 'ไม่มี', 300000, 0, 'ดูหนังและฟังเพลง', 'ด้านมนุษย์สัมพันธ์', 'ทำงานที่บ้าน (WFH)', 'นักลงทุน'),
(33, 'ชาย', 5, 'โสด', 5, 1, 'ไม่มี', 0, 0, 'ทำงานฝีมือ/งานศิลปะ', 'ด้านศิลปะ/งานฝีมือ, ด้านมนุษย์สัมพันธ์', 'ทำงานที่บ้าน (WFH)', 'นักวาดภาพ'),
(34, 'ชาย', 6, 'โสด', 3, 6, 'บิดา/มารดา', 200000, 0, 'ปลูกต้นไม้', 'ด้านการเกษตร', 'รถยนต์ส่วนตัว', 'พนักงาน'),
(35, 'ชาย', 6, 'โสด', 7, 1, 'บิดา/มารดา', 0, 0, 'เล่นดนตรี/ร้องเพลง', 'ด้านดนตรี', 'รถโดยสารประจำทาง', 'พนักงานเสิร์ฟอาหาร'),
(36, 'หญิง', 5, 'โสด', 2, 1, 'ไม่มี', 0, 0, 'ทำอาหาร', 'ด้านคอมพิวเตอร์', 'รถโดยสารประจำทาง', 'พนักงานเอกชน'),
(37, 'หญิง', 6, 'โสด', 2, 2, 'บิดา/มารดา', 0, 0, 'เล่นกีฬา/ออกกำลังกาย, ปลูกต้นไม้, เลี้ยงสัตว์', 'ด้านศิลปะ/งานฝีมือ, ด้านการเกษตร', 'จักรยาน', 'พนักงานเอกชน'),
(38, 'ชาย', 2, 'สมรส', 3, 1, 'สามี/ภรรยา', 0, 0, 'ทำอาหาร', 'ด้านการช่าง/ซ่อมแซม', 'เดินเท้า', 'พนักงานโรงงาน'),
(39, 'หญิง', 6, 'สมรส', 4, 3, 'ไม่มี', 3000, 0, 'ทำงานฝีมือ/งานศิลปะ', 'ด้านศิลปะ/งานฝีมือ', 'เดินเท้า', 'พนักงานบริษัท kcf'),
(40, 'ชาย', 3, 'สมรส', 3, 6, 'ลูก/หลาน', 0, 0, 'เลี้ยงสัตว์', 'ด้านการช่าง/ซ่อมแซม', 'รถยนต์ส่วนตัว', 'พนักงานฟาร์มปศุสัตว์'),
(41, 'หญิง', 5, 'โสด', 3, 1, 'ไม่มี', 0, 20000, 'ทำอาหาร, ปลูกต้นไม้', 'ด้านประกอบอาหาร, ด้านคอมพิวเตอร์', 'เดินเท้า', 'พนักงานรัฐวิสาหกิจ'),
(42, 'หญิง', 6, 'โสด', 9, 4, 'ไม่มี', 0, 0, 'ไม่มี', 'ด้านภาษา', 'รถโดยสารประจำทาง', 'พนักงานราชการ'),
(43, 'ชาย', 3, 'โสด', 3, 1, 'ไม่มี', 0, 0, 'ทำอาหาร', 'ด้านภาษา', 'เดินเท้า', 'พนักงานส่งของเคอรี่'),
(44, 'หญิง', 6, 'โสด', 3, 1, 'ไม่มี', 0, 0, 'เลี้ยงสัตว์', 'ด้านภาษา', 'รถยนต์ส่วนตัว', 'พนักงานออฟฟิศ'),
(45, 'ชาย', 3, 'โสด', 3, 1, 'ไม่มี', 0, 0, 'ปลูกต้นไม้', 'ด้านมนุษย์สัมพันธ์', 'รถโดยสารประจำทาง', 'รับจ้างขายของ หรือทำความสะอาด'),
(46, 'หญิง', 1, 'แยกกันอยู่', 8, 7, 'ไม่มี', 0, 0, 'ทำงานฝีมือ/งานศิลปะ, ทำอาหาร, เลี้ยงสัตว์', 'ด้านมนุษย์สัมพันธ์', 'ทำงานที่บ้าน (WFH)', 'รับจ้างทั่วไป'),
(47, 'ชาย', 5, 'โสด', 3, 1, 'ไม่มี', 5000, 0, 'ปลูกต้นไม้', 'ด้านดนตรี', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(48, 'หญิง', 6, 'โสด', 3, 6, 'ไม่มี', 0, 40000, 'ไม่มี', 'ด้านตรรกะ, ด้านมนุษย์สัมพันธ์', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(49, 'ชาย', 1, 'โสด', 3, 1, 'ไม่มี', 0, 20000, 'ไม่มี', 'ไม่มี', 'เดินเท้า', 'รับจ้างทั่วไป'),
(50, 'ชาย', 5, 'โสด', 3, 1, 'ไม่มี', 0, 0, 'เล่นกีฬา/ออกกำลังกาย', 'ด้านมนุษย์สัมพันธ์', 'เดินเท้า', 'รับจ้างทั่วไป'),
(51, 'ชาย', 2, 'โสด', 1, 1, 'ไม่มี', 0, 0, 'เลี้ยงสัตว์', 'ด้านการเกษตร', 'เดินเท้า', 'รับจ้างทั่วไป'),
(52, 'หญิง', 5, 'สมรส', 3, 1, 'ไม่มี', 50000, 20000, 'เลี้ยงสัตว์', 'ไม่มี', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(53, 'หญิง', 3, 'สมรส', 3, 1, 'ไม่มี', 0, 0, 'เลี้ยงสัตว์', 'ด้านศิลปะ/งานฝีมือ', 'รถจักรยานยนต์ส่วนตัว', 'รับจ้างทั่วไป'),
(54, 'ชาย', 6, 'โสด', 3, 6, 'บิดา/มารดา', 184000, 0, 'ปลูกต้นไม้', 'ด้านการเกษตร', 'ติดรถผู้อื่นไปทำงาน', 'รับจ้างทำการเกษตร'),
(55, 'ชาย', 3, 'โสด', 1, 1, 'บิดา/มารดา', 0, 0, 'รับจ้างส่งของ', 'ด้านกีฬา', 'รถยนต์ส่วนตัว', 'รับจ้างส่งของ');

-- --------------------------------------------------------

--
-- Table structure for table `feedback`
--

CREATE TABLE `feedback` (
  `id` int(3) NOT NULL,
  `question1` int(2) DEFAULT NULL,
  `question2` int(2) DEFAULT NULL,
  `question3` int(2) DEFAULT NULL,
  `question4` int(2) DEFAULT NULL,
  `question5` int(2) DEFAULT NULL,
  `question6` int(2) DEFAULT NULL,
  `comment` varchar(50) DEFAULT NULL,
  `timestamp_column` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `feedback`
--

INSERT INTO `feedback` (`id`, `question1`, `question2`, `question3`, `question4`, `question5`, `question6`, `comment`, `timestamp_column`) VALUES
(6, 4, 3, 5, 3, 4, 5, '', '2023-10-03 03:54:44'),
(7, 5, 4, 4, 4, 5, 5, '', '2023-10-03 03:54:44'),
(8, 4, 4, 4, 4, 4, 4, '', '2023-10-03 03:54:44'),
(9, 4, 3, 4, 3, 4, 3, '', '2023-10-03 03:54:44'),
(10, 3, 3, 3, 3, 3, 3, '', '2023-10-03 03:54:44'),
(11, 4, 4, 4, 4, 4, 4, '', '2023-10-03 03:54:44'),
(12, 4, 4, 4, 4, 4, 4, '', '2023-10-03 03:54:44'),
(13, 3, 3, 3, 4, 4, 4, '', '2023-10-03 03:54:44'),
(14, 3, 3, 3, 3, 3, 3, '', '2023-10-03 03:55:47'),
(17, 3, 3, 3, 2, 2, 2, '', '2023-10-03 04:04:37'),
(18, 4, 4, 4, 4, 4, 4, '', '2023-10-03 04:05:10'),
(19, 4, 4, 4, 3, 4, 3, '', '2023-10-03 04:07:05'),
(21, 5, 5, 5, 5, 5, 5, '', '2023-10-03 04:09:33'),
(22, 5, 5, 5, 5, 5, 5, '', '2023-10-03 04:11:17'),
(23, 5, 5, 5, 5, 4, 4, '', '2023-10-03 04:14:32'),
(24, 4, 4, 5, 4, 5, 5, '', '2023-10-03 04:16:15'),
(25, 3, 4, 3, 3, 5, 5, '', '2023-10-03 04:18:14'),
(28, 5, 5, 5, 5, 5, 4, '', '2023-10-03 04:27:19'),
(29, 5, 5, 5, 4, 5, 5, '', '2023-10-03 04:29:17'),
(30, 5, 5, 5, 4, 5, 4, '', '2023-10-03 04:30:37'),
(31, 5, 5, 5, 5, 5, 4, '', '2023-10-03 04:32:00'),
(32, 5, 5, 5, 5, 5, 4, '', '2023-10-03 04:32:11'),
(33, 5, 4, 4, 5, 5, 4, '', '2023-10-03 04:32:13'),
(34, 4, 5, 4, 5, 5, 5, 'น่าจะเพิ่มผู้พิการด้านสายตาสั้นด้วย', '2023-10-03 04:36:27'),
(35, 5, 5, 5, 5, 5, 5, '', '2023-10-03 04:39:15'),
(36, 5, 4, 4, 5, 5, 4, '', '2023-10-03 04:49:06'),
(37, 5, 5, 5, 4, 5, 4, '', '2023-10-03 04:52:39'),
(38, 4, 4, 3, 4, 5, 4, '', '2023-10-03 05:35:03'),
(39, 5, 4, 4, 4, 4, 4, '', '2023-10-03 07:25:23'),
(40, 3, 2, 2, 2, 4, 3, '', '2023-10-03 07:43:27'),
(41, 3, 5, 5, 5, 5, 3, 'ต้อเรียนรู้เพิ่มเติมเรื่อยๆ', '2023-10-03 07:50:52'),
(42, 5, 3, 3, 4, 3, 5, '', '2023-10-03 08:05:31'),
(43, 4, 4, 4, 4, 4, 3, '', '2023-10-03 08:58:49'),
(45, 4, 5, 4, 4, 4, 5, '', '2023-10-04 09:35:35'),
(46, 3, 3, 4, 4, 5, 4, '', '2023-10-04 12:58:53'),
(47, 4, 5, 4, 5, 5, 5, '', '2023-10-04 14:59:47');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `data_newer1`
--
ALTER TABLE `data_newer1`
  ADD PRIMARY KEY (`ID`);

--
-- Indexes for table `feedback`
--
ALTER TABLE `feedback`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `data_newer1`
--
ALTER TABLE `data_newer1`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=56;

--
-- AUTO_INCREMENT for table `feedback`
--
ALTER TABLE `feedback`
  MODIFY `id` int(3) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=48;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
